---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewRegionsRemoved
source: html/f1e74351-f2c8-39c1-3873-7c465efe70f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewRegionsRemoved Property

Some View Regions were removed. When the size of a View Region becomes zero, it is removed from the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZeroLengthViewRegionsRemoved { get; }
```